/*
阴阳遁:夏至后用阴遁　冬至后用阳遁

甲子遁戊 甲戌遁己 甲申遁庚 甲午遁辛 甲辰遁壬 甲寅遁癸

三奇六仪：戊己庚辛壬癸乙丙丁 阳顺阴逆排
九星:蓬任冲辅英芮柱心
八门:休生伤杜景死惊开
八神: 值符　腾蛇　太阴　六合　白虎(阴遁用)/勾陈(阳遁用)　玄武(阴遁用)/朱雀(阳遁用)　九地　九天

九宫 八门 紫白
坎一宫　五行水　天蓬星　休门 一白
艮八宫　五行土　天任星　生门 八白
震三宫　五行木　天冲星　伤门 三碧
巽四宫　五行木　天辅星　杜门 四绿
－－－－中宫(五)天禽       五黄
离九宫　五行火　天英星　景门 九紫
坤二宫　五行土　天芮星　死门 二黑
兑七宫　五行金　天柱星　惊门 七赤
乾六宫　五行金　天心星　开门 六白

九星信息
坎卦一宫水天蓬(贪狼)　艮卦八宫土天任(左辅)　 震卦三宫木天冲(禄存)　巽卦四宫木天辅(文曲)
中央土天禽(廉贞)
离卦九宫火天英(右弼)　坤卦二宫土天芮(rui)(巨门)　兑卦七宫金天柱(破军)　乾卦六宫金天心(武曲)

吉凶:
天辅 天禽 天心为上吉
天冲 天任 次吉
天蓬 天芮 大凶
天柱 天英 小凶

三奇之灵:
乙日 丙月 丁星 与开休生三门即吉

*/

package sjqm
