package sjqm

import (
	"reflect"
	"testing"
)

/*
甲长生map:map[丑:冠带 亥:长生 午:死 卯:帝旺 子:沐浴 寅:临官 巳:病 戌:养 未:墓 申:绝 辰:衰 酉:胎]
乙长生map:map[丑:衰 亥:死 午:长生 卯:临官 子:病 寅:帝旺 巳:沐浴 戌:墓 未:养 申:胎 辰:冠带 酉:绝]
丙长生map:map[丑:养 亥:绝 午:帝旺 卯:沐浴 子:胎 寅:长生 巳:临官 戌:墓 未:衰 申:病 辰:冠带 酉:死]
丁长生map:map[丑:墓 亥:胎 午:临官 卯:病 子:绝 寅:死 巳:帝旺 戌:养 未:冠带 申:沐浴 辰:衰 酉:长生]
戊长生map:map[丑:养 亥:绝 午:帝旺 卯:沐浴 子:胎 寅:长生 巳:临官 戌:墓 未:衰 申:病 辰:冠带 酉:死]
己长生map:map[丑:墓 亥:胎 午:临官 卯:病 子:绝 寅:死 巳:帝旺 戌:养 未:冠带 申:沐浴 辰:衰 酉:长生]
庚长生map:map[丑:墓 亥:病 午:沐浴 卯:胎 子:死 寅:绝 巳:长生 戌:衰 未:冠带 申:临官 辰:养 酉:帝旺]
辛长生map:map[丑:养 亥:沐浴 午:病 卯:绝 子:长生 寅:胎 巳:死 戌:冠带 未:衰 申:帝旺 辰:墓 酉:临官]
壬长生map:map[丑:衰 亥:临官 午:胎 卯:死 子:帝旺 寅:病 巳:绝 戌:冠带 未:养 申:长生 辰:墓 酉:沐浴]
癸长生map:map[丑:冠带 亥:帝旺 午:绝 卯:长生 子:临官 寅:沐浴 巳:胎 戌:衰 未:墓 申:死 辰:养 酉:病]
*/
// go test --run TestChangSheng
//甲长生位亥 乙长生位午 丙长生位寅 丁长生位酉 戊长生位寅 己长生位酉 庚长生位巳 辛长生位子 壬长生位申 癸长生位卯
//十干长生位
func TestChangSheng(t *testing.T) {
	gan := []string{"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"}
	//顺序0:甲 9:癸
	want := []map[string]string{
		{"丑": "冠带", "亥": "长生", "午": "死", "卯": "帝旺", "子": "沐浴", "寅": "临官", "巳": "病", "戌": "养", "未": "墓", "申": "绝", "辰": "衰", "酉": "胎"},
		{"丑": "衰", "亥": "死", "午": "长生", "卯": "临官", "子": "病", "寅": "帝旺", "巳": "沐浴", "戌": "墓", "未": "养", "申": "胎", "辰": "冠带", "酉": "绝"},
		{"丑": "养", "亥": "绝", "午": "帝旺", "卯": "沐浴", "子": "胎", "寅": "长生", "巳": "临官", "戌": "墓", "未": "衰", "申": "病", "辰": "冠带", "酉": "死"},
		{"丑": "墓", "亥": "胎", "午": "临官", "卯": "病", "子": "绝", "寅": "死", "巳": "帝旺", "戌": "养", "未": "冠带", "申": "沐浴", "辰": "衰", "酉": "长生"},
		{"丑": "养", "亥": "绝", "午": "帝旺", "卯": "沐浴", "子": "胎", "寅": "长生", "巳": "临官", "戌": "墓", "未": "衰", "申": "病", "辰": "冠带", "酉": "死"},
		{"丑": "墓", "亥": "胎", "午": "临官", "卯": "病", "子": "绝", "寅": "死", "巳": "帝旺", "戌": "养", "未": "冠带", "申": "沐浴", "辰": "衰", "酉": "长生"},
		{"丑": "墓", "亥": "病", "午": "沐浴", "卯": "胎", "子": "死", "寅": "绝", "巳": "长生", "戌": "衰", "未": "冠带", "申": "临官", "辰": "养", "酉": "帝旺"},
		{"丑": "养", "亥": "沐浴", "午": "病", "卯": "绝", "子": "长生", "寅": "胎", "巳": "死", "戌": "冠带", "未": "衰", "申": "帝旺", "辰": "墓", "酉": "临官"},
		{"丑": "衰", "亥": "临官", "午": "胎", "卯": "死", "子": "帝旺", "寅": "病", "巳": "绝", "戌": "冠带", "未": "养", "申": "长生", "辰": "墓", "酉": "沐浴"},
		{"丑": "冠带", "亥": "帝旺", "午": "绝", "卯": "长生", "子": "临官", "寅": "沐浴", "巳": "胎", "戌": "衰", "未": "墓", "申": "死", "辰": "养", "酉": "病"},
	}
	for i := 0; i < len(gan); i++ {
		chmap := ChangSheng(gan[i])
		for j := i; j < len(want); j++ {
			if !reflect.DeepEqual(chmap, want[j]) {
				t.Errorf("func ChangSheng(%s)=%v want:%v", gan[i], chmap, want[j])
			}
			break
		}
	}
}
